Calcular o coeficiente e a taxa de evasão

In [109]:
import pandas as pd
import numpy as np

In [110]:
tabela = { 'Ano graduação' : ['1º', '2º', '3º', '4º','Total'], 'Matrículas março' : [70, 50, 47, 23, 190], 'Matrículas novembro' : [65, 48, 40, 22, 175]}

In [111]:
tabela

{'Ano graduação': ['1º', '2º', '3º', '4º', 'Total'],
 'Matrículas março': [70, 50, 47, 23, 190],
 'Matrículas novembro': [65, 48, 40, 22, 175]}

In [112]:
dataset = pd.DataFrame(tabela)
dataset

  Ano graduação  Matrículas março  Matrículas novembro
0            1º                70                   65
1            2º                50                   48
2            3º                47                   40
3            4º                23                   22
4         Total               190                  175

In [113]:
dataset['evasao'] = dataset['Matrículas março'] - dataset['Matrículas novembro']
dataset

  Ano graduação  Matrículas março  Matrículas novembro  evasao
0            1º                70                   65       5
1            2º                50                   48       2
2            3º                47                   40       7
3            4º                23                   22       1
4         Total               190                  175      15

In [114]:
dataset['Taxa evasao'] = (dataset['evasao'] / dataset['Matrículas março']) * 100
dataset

  Ano graduação  Matrículas março  Matrículas novembro  evasao  Taxa evasao
0            1º                70                   65       5     7.142857
1            2º                50                   48       2     4.000000
2            3º                47                   40       7    14.893617
3            4º                23                   22       1     4.347826
4         Total               190                  175      15     7.894737